views/tag/index.php

SELECT * FROM `post` WHERE 0=1
---
                        <td><?= $tag->id ?></td>
                        <td><?= Html::encode($tag->name) ?></td>
                        <td><?= Html::encode($tag->slug) ?></td>
                        <td><?= count($tag->getPosts()->all()) ?></td>