views/category/index.php

                        <td><?= $category->id ?></td>
                        <td><?= Html::encode($category->name) ?></td>
                        <td><?= Html::encode($category->slug) ?></td>
                        <td><?= count($category->getPosts()->all()) ?></td>
---
SELECT * FROM `post` WHERE `category_id`=1