controllers/CategoryController.php

SELECT COUNT(*) FROM `category`
SELECT * FROM `category` LIMIT 20
---
    public function actionIndex()
    {
        $query = Category::find();

        $pagination = new Pagination([
            'defaultPageSize' => 20,
            'totalCount' => $query->count(),
        ]);

        $categories = $query->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();

SELECT * FROM `category` WHERE `slug`='plansheti'
SELECT COUNT(*) FROM `post` WHERE (`category_id`=3) AND (`status`=1)
SELECT * FROM `post` WHERE (`category_id`=3) AND (`status`=1) ORDER BY `created_at` DESC LIMIT 10
---
    public function actionView($slug)
    {
        $category = Category::findOne(['slug' => $slug]);
        if (!$category) {
            throw new NotFoundHttpException('Категорія не знайдена.');
        }

        $query = Post::find()
            ->where(['category_id' => $category->id, 'status' => Post::STATUS_PUBLISHED])
            ->with('author')
            ->orderBy(['created_at' => SORT_DESC]);

        $pagination = new Pagination([
            'defaultPageSize' => 10,
            'totalCount' => $query->count(),
        ]);

        $posts = $query->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();

SELECT * FROM `category` WHERE `id`='8'
---
    protected function findModel($id)
    {
        if (($model = Category::findOne($id)) !== null) {