controllers/CommentController.php

INSERT INTO `comment` (`post_id`, `user_id`, `name`, `email`, `content`, `status`, `created_at`, `updated_at`) VALUES (4, 3, 'Дмитро', 'dmytro.m@gmail.com', 'Чудова стаття! Цікаво було прочитати)', 1, 1767553992, 1767553992)
---
    public function actionCreate()
    {
        $comment = new Comment();

        if ($this->request->isPost) {
            $comment->load($this->request->post());
            $comment->status = Comment::STATUS_ACTIVE;

            if ($comment->save()) {

SELECT * FROM `post` WHERE `id`='4'
---
    public function actionUpdate($id)
    {
        $comment = Comment::findOne($id);
        if (!$comment) {
            throw new NotFoundHttpException('Коментар не знайдено.');
        }

        if ($this->request->isPost) {
            $comment->load($this->request->post());