controllers/PostController.php

SELECT * FROM `post` WHERE `slug`='iphone-15-pro-nainovishyi-flahman-apple'
SELECT * FROM `comment` WHERE (`post_id`=4) AND (`parent_id` IS NULL) AND (`status`=1) ORDER BY `created_at` DESC
---
    public function actionView($slug)
    {
        $post = Post::findOne(['slug' => $slug]);
        if (!$post) {
            throw new NotFoundHttpException('Статтю не знайдено.');
        }

        // Відображення чернеток лише для автора або адміністратора
        if ($post->status == Post::STATUS_DRAFT && (\Yii::$app->user->isGuest || \Yii::$app->user->id != $post->author_id)) {
            throw new NotFoundHttpException('Статтю не знайдено.');
        }

        $comments = Comment::find()
            ->where(['post_id' => $post->id, 'parent_id' => null, 'status' => Comment::STATUS_ACTIVE])
            ->with('replies', 'user')
            ->orderBy(['created_at' => SORT_DESC])
            ->all();

SELECT * FROM `category`
---
            }
        }

        $categories = Category::find()->all();