controllers/PostController.php

SELECT * FROM `category` WHERE `id` IN (1, 3)
SELECT COUNT(*) FROM `post` WHERE (`status`=1) OR ((`status`=0) AND (`author_id`=4))
SELECT COUNT(*) FROM `post` WHERE (`status`=1) OR ((`status`=0) AND (`author_id`=1))
SELECT * FROM `category` WHERE `id` IN (4, 1, 3)
SELECT * FROM `post` WHERE (`status`=1) OR ((`status`=0) AND (`author_id`=1)) ORDER BY `created_at` DESC LIMIT 10
---
    public function actionIndex()
    {
        $query = Post::find()
            ->with('author', 'category');

        // Відображення опублікованих публікацій та чернеток для їх авторів
        if (\Yii::$app->user->isGuest) {
            $query->where(['status' => Post::STATUS_PUBLISHED]);
        } else {
            $query->andWhere(['or',
                ['status' => Post::STATUS_PUBLISHED],
                ['and', ['status' => Post::STATUS_DRAFT], ['author_id' => \Yii::$app->user->id]]
            ]);
        }

        $query->orderBy(['created_at' => SORT_DESC]);

        $pagination = new \yii\data\Pagination([
            'defaultPageSize' => 10,
            'totalCount' => $query->count(),
        ]);

        $posts = $query->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();

SELECT * FROM `post` WHERE `slug`='proba234'
SELECT * FROM `comment` WHERE (`post_id`=6) AND (`parent_id` IS NULL) AND (`status`=1) ORDER BY `created_at` DESC
---
    public function actionView($slug)
    {
        $post = Post::findOne(['slug' => $slug]);
        if (!$post) {
            throw new NotFoundHttpException('Статтю не знайдено.');
        }

        // Відображення чернеток лише для автора або адміністратора
        if ($post->status == Post::STATUS_DRAFT && (\Yii::$app->user->isGuest || \Yii::$app->user->id != $post->author_id)) {
            throw new NotFoundHttpException('Статтю не знайдено.');
        }

        $comments = Comment::find()
            ->where(['post_id' => $post->id, 'parent_id' => null, 'status' => Comment::STATUS_ACTIVE])
            ->with('replies', 'user')
            ->orderBy(['created_at' => SORT_DESC])
            ->all();

DELETE FROM `post_tag` WHERE `post_id`=6
INSERT INTO `post_tag` (`post_id`, `tag_id`) VALUES (6, 7)
---
    public function actionCreate()
    {
        $post = new Post();
        $post->author_id = \Yii::$app->user->id;
        $post->status = Post::STATUS_DRAFT;

        if ($this->request->isPost) {
            $post->load($this->request->post());
            $post->imageFile = \yii\web\UploadedFile::getInstance($post, 'imageFile');

            if (isset($this->request->post()['tags'])) {
                $tags = $this->request->post()['tags'];
            } else {
                $tags = [];
            }

            if ($post->save()) {
                $post->uploadImage();
                if ($post->image) {
                    $post->save(false);
                }

                // Збереження міток
                PostTag::deleteAll(['post_id' => $post->id]);
                foreach ($tags as $tag_id) {
                    $postTag = new PostTag();
                    $postTag->post_id = $post->id;
                    $postTag->tag_id = $tag_id;
                    $postTag->save();

SELECT * FROM `category`
---
            }
        }

        $categories = Category::find()->all();

DELETE FROM `post_tag` WHERE `post_id`=3
---
    public function actionUpdate($id)
    {
        $post = $this->findModel($id);
        $oldImage = $post->image;

        if ($this->request->isPost) {
            $post->load($this->request->post());
            $post->image = $oldImage;
            $post->imageFile = \yii\web\UploadedFile::getInstance($post, 'imageFile');

            if (isset($this->request->post()['tags'])) {
                $tags = $this->request->post()['tags'];
            } else {
                $tags = [];
            }

            if ($post->save()) {
                if ($post->imageFile) {
                    $post->uploadImage();
                    if ($post->image) {
                        $post->save(false);
                    }
                } else {
                    $post->image = $oldImage;
                    $post->save(false);
                }

                // Збереження міток
                PostTag::deleteAll(['post_id' => $post->id]);

INSERT INTO `post_tag` (`post_id`, `tag_id`) VALUES (3, 4)
---
                    $postTag = new PostTag();
                    $postTag->post_id = $post->id;
                    $postTag->tag_id = $tag_id;
                    $postTag->save();

SELECT * FROM `category`
SELECT * FROM `post_tag` WHERE `post_id`=6
SELECT * FROM `tag` WHERE `id` IN (7, 8)
---
            }
        }

        $categories = Category::find()->all();
        $allTags = Tag::find()->all();

SELECT * FROM `post` WHERE `id`='3'
---
    protected function findModel($id)
    {
        if (($model = Post::findOne(['id' => $id])) !== null) {