controllers/SiteController.php

SELECT * FROM `category` WHERE `id` IN (4, 1, 3)
SELECT * FROM `post` WHERE `status`=1 ORDER BY `created_at` DESC LIMIT 5
SELECT `category`.* FROM `category` INNER JOIN `post` ON `category`.`id` = `post`.`category_id` GROUP BY `category`.`id` ORDER BY COUNT(post.id) DESC
SELECT `tag`.* FROM `tag` INNER JOIN `post_tag` ON `tag`.`id` = `post_tag`.`tag_id` INNER JOIN `post` ON `post_tag`.`post_id` = `post`.`id` GROUP BY `tag`.`id` ORDER BY COUNT(post.id) DESC
SELECT * FROM `category` ORDER BY `name`
---
    public function actionIndex()
    {
        $posts = Post::find()
            ->where(['status' => Post::STATUS_PUBLISHED])
            ->with('author', 'category')
            ->orderBy(['created_at' => SORT_DESC])
            ->limit(5)
            ->all();

        // Отримати мітки з хоча б одним дописом
        $tags = Tag::find()
            ->innerJoinWith('posts', false)
            ->groupBy(['tag.id'])
            ->orderBy(['COUNT(post.id)' => SORT_DESC])
            ->all();

        // Отримати всі категорії
        $categories = Category::find()
            ->orderBy(['name' => SORT_ASC])
            ->all();