controllers/TagController.php

    public function actionIndex()
    {
        $query = Tag::find();

        $pagination = new Pagination([
            'defaultPageSize' => 20,
            'totalCount' => $query->count(),
        ]);

        $tags = $query->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();
---
SELECT COUNT(*) FROM `tag`
SELECT * FROM `tag` LIMIT 20

    public function actionView($slug)
    {
        $tag = Tag::findOne(['slug' => $slug]);
        if (!$tag) {
            throw new NotFoundHttpException('Мітка не знайдена.');
        }

        $query = Post::find()
            ->joinWith('tags')
            ->where(['{{%tag}}.id' => $tag->id, '{{%post}}.status' => Post::STATUS_PUBLISHED])
            ->with('author', 'category')
            ->orderBy(['{{%post}}.created_at' => SORT_DESC])
            ->distinct();

        $pagination = new Pagination([
            'defaultPageSize' => 10,
            'totalCount' => $query->count(),
        ]);

        $posts = $query->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();
---
SELECT * FROM `tag` WHERE `slug`='iphone'
SELECT COUNT(*) FROM (SELECT DISTINCT `post`.* FROM `post` LEFT JOIN `post_tag` ON `post`.`id` = `post_tag`.`post_id` LEFT JOIN `tag` ON `post_tag`.`tag_id` = `tag`.`id` WHERE (`tag`.`id`=1) AND (`post`.`status`=1) ORDER BY `post`.`created_at` DESC) `c`
SELECT * FROM `category` WHERE `id` IN (1, 3)
SELECT * FROM `post_tag` WHERE `post_id` IN (1, 3)
SELECT * FROM `tag` WHERE `id` IN (1, 4, 7, 9)
SELECT DISTINCT `post`.* FROM `post` LEFT JOIN `post_tag` ON `post`.`id` = `post_tag`.`post_id` LEFT JOIN `tag` ON `post_tag`.`tag_id` = `tag`.`id` WHERE (`tag`.`id`=1) AND (`post`.`status`=1) ORDER BY `post`.`created_at` DESC LIMIT 10

    protected function findModel($id)
    {
        if (($model = Tag::findOne($id)) !== null) {
---
SELECT * FROM `tag` WHERE `id`='1'