models/LoginForm.php

    public function login()
    {
        if ($this->validate()) {
            $user = $this->getUser();
            $user->generateAuthKey();
            $user->generateAccessToken();
            $user->save();
---
UPDATE `user` SET `auth_key`='wgCLWl0FkFLoIuXXCWsjRicxdNfA0EcB', `access_token`='F1DD5-q7DuAsVV5_acsog9aMW6zVI6qw_1767516413', `updated_at`=1767516414 WHERE `id`=2